In [14]:
# 1. create element wise comaprision (>,<,>=,<=) of two given arrays

import numpy as np
x = np.array([5,9,15,32])
y = np.array([3,16,10,41])
print("Original Arrays")
print(x);print(y)
print("Comparision - Greater")
print(np.greater(x,y))
print("Comparision - Lesser")
print(np.less(x,y))
print("Comparision - Greater_equal")
print(np.greater_equal(x,y))
print("Comparision - Less_eaual")
print(np.less_equal(x,y))

Original Arrays
[ 5  9 15 32]
[ 3 16 10 41]
Comparision - Greater
[ True False  True False]
Comparision - Lesser
[False  True False  True]
Comparision - Greater_equal
[ True False  True False]
Comparision - Less_eaual
[False  True False  True]

In [42]:
# 2. Numpy program to create an array of 10 zeros, 10 ones, 10 fives

print("10 Ones :",np.ones(10,))
print("10 Zeros :",np.zeros(10,))
print("10 Fives :",np.array([5] * 10))

10 Ones : [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
10 Zeros : [0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
10 Fives : [5 5 5 5 5 5 5 5 5 5]

In [46]:
# 3. Peforming sum of each row and sum of each column and sum of all elements

x = np.array([[5,16,24],[21,3,49]])
print("Sum of all elements :",np.sum(x))
print("Sum of elements row wise :",np.sum(x,axis=1))
print("Sum of elements column wise :",np.sum(x,axis=0))

Sum of all elements : 118
Sum of elements row wise : [45 73]
Sum of elements column wise : [26 19 73]

In [54]:
# 4. Numpy program to add,substract,multiply,divide arguments element wise

x = np.array([10,25,13,46,19])
print('Original array :',x)
print("Adding by 5 :", x + 5)
print("Substract by 5 :", x - 5)
print("Multiply by 5 :", x * 5)
print("Divide by 5 :", x / 5)

Original array : [10 25 13 46 19]
Adding by 5 : [15 30 18 51 24]
Substract by 5 : [ 5 20  8 41 14]
Multiply by 5 : [ 50 125  65 230  95]
Divide by 5 : [2.  5.  2.6 9.2 3.8]

In [75]:
# 5. Numpy program to compute trignometric functions

print("Sin values for the corresponding angles :",(np.sin([0,45,60,90])))
print("Cos values for the corresponding angles :",(np.cos([0,30,45,90])))
print("Tan values for the corresponding angles :",(np.tan([0,30,45,90])))

Sin values for the corresponding angles : [ 0.          0.85090352 -0.30481062  0.89399666]
Cos values for the corresponding angles : [ 1.          0.15425145  0.52532199 -0.44807362]
Tan values for the corresponding angles : [ 0.         -6.4053312   1.61977519 -1.99520041]

In [105]:
# 6. Pandas program to display the dataframe from specified dic which has index labels

import pandas as pd
data = pd.DataFrame({'Name':['Sharath','Candy','Tom'],'Score':[975,849,916],'Branch':['MEC','CSE','EEE'],
                    'sports':['Football','Rugby','Soccer']},index=[1,2,3])
data

      Name  Score Branch    sports
1  Sharath    975    MEC  Football
2    Candy    849    CSE     Rugby
3      Tom    916    EEE    Soccer

In [108]:
# 7. Pandas program to select names and score coloumns from the dataframe

dataset = pd.DataFrame({'Name':['Jocky','Roadster','Tommy'],'Score':[749,536,748],'Branch':['CE','ECE','AE'],
                       'games':['Coco','basketball','Tennis']},index=[1,2,3])
dataset.iloc[:,0:2]

       Name  Score
1     Jocky    749
2  Roadster    536
3     Tommy    748

In [109]:
# 8. Merging two dataframe along with rows

df = pd.merge(data,dataset,how='outer')
df

       Name  Score Branch    sports       games
0   Sharath    975    MEC  Football         NaN
1     Candy    849    CSE     Rugby         NaN
2       Tom    916    EEE    Soccer         NaN
3     Jocky    749     CE       NaN        Coco
4  Roadster    536    ECE       NaN  basketball
5     Tommy    748     AE       NaN      Tennis

In [110]:
# 9. Pandas program to detect missing values of a given dataframe. Display true or false

df.isna().any()

Name      False
Score     False
Branch    False
sports     True
games      True
dtype: bool

In [117]:
# 10. pandas program to create and display one-dimensional array like object containg an array of data

data = pd.Series([16,75,16,25,95])
data

0    16
1    75
2    16
3    25
4    95
dtype: int64